org/20220306194641-relational_programming.org
:PROPERTIES:
:ID:       f9dc079d-0b83-4ab5-afc4-c3a7045fb6a9
:END:
#+TITLE: Symbolic and relational programming
#+filetags: :notebook:
#+CREATED: [2022-03-06 Sun 19:46]
#+LAST_MODIFIED: [2022-05-27 Fri 10:30]


* Reading

- Willsey et al.: [[https://arxiv.org/pdf/2004.03082.pdf][egg: Fast and Extensible Equality Saturation]]
- Steele & Byrd: [[https://arxiv.org/abs/2008.03441][dxo: A System for Relational Algebra and Differentiation]]
- Friedman, Byrd & Kiselyov: The Reasoned Schemer
- Norvig: [[id:7258c862-403a-4269-86f5-9311ef1cccdd][Paradigms of Artifical Intelligence Programming]]

* Code

- [[https://github.com/pythological][Pythological]] organization on github
- Peter Norvig released [[https://github.com/norvig/paip-lisp][PAIP's code]]
