20220306194641-relational_programming.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-12-18 Sun 09:22 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Symbolic and relational programming</title>
<meta name="author" content="Rémi Louf" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="style.css" /></head>
<body>
<div id="content" class="content">
<h1 class="title">Symbolic and relational programming</h1>


<div id="outline-container-org1c04ba9" class="outline-2">
<h2 id="org1c04ba9">Reading</h2>
<div class="outline-text-2" id="text-org1c04ba9">
<ul class="org-ul">
<li>Willsey et al.: <a target='_blank' rel='noopener noreferrer' class='external' href="https://arxiv.org/pdf/2004.03082.pdf">egg: Fast and Extensible Equality Saturation</a></li>
<li>Steele &amp; Byrd: <a target='_blank' rel='noopener noreferrer' class='external' href="https://arxiv.org/abs/2008.03441">dxo: A System for Relational Algebra and Differentiation</a></li>
<li>Friedman, Byrd &amp; Kiselyov: The Reasoned Schemer</li>
<li>Norvig: <a href="20220405161117-paradigms_of_artifical_intelligence_programming.html#ID-7258c862-403a-4269-86f5-9311ef1cccdd">Paradigms of Artifical Intelligence Programming</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgba882df" class="outline-2">
<h2 id="orgba882df">Code</h2>
<div class="outline-text-2" id="text-orgba882df">
<ul class="org-ul">
<li><a target='_blank' rel='noopener noreferrer' class='external' href="https://github.com/pythological">Pythological</a> organization on github</li>
<li>Peter Norvig released <a target='_blank' rel='noopener noreferrer' class='external' href="https://github.com/norvig/paip-lisp">PAIP's code</a></li>
<li>PiCat</li>
</ul>
</div>
</div>

<div id="outline-container-org7cf6a4d" class="outline-2">
<h2 id="org7cf6a4d">Links to this note</h2>
<div class="outline-text-2" id="text-org7cf6a4d">
<ul class="org-ul">
<li><a href="./20220804135950-minikanren.html">miniKanren</a></li>
</ul>
</div>
</div>
</div>
</body>
</html>